____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_1 (InputLayer)             (None, 68)            0                                            
____________________________________________________________________________________________________
input_2 (InputLayer)             (None, 4)             0                                            
____________________________________________________________________________________________________
sequential_1 (Sequential)        multiple              1408        input_1[0][0]                    
____________________________________________________________________________________________________
sequential_3 (Sequential)        (None, 4, 64)         1408        input_2[0][0]                    
____________________________________________________________________________________________________
dot_1 (Dot)                      (None, 68, 4)         0           sequential_1[1][0]               
                                                                   sequential_3[1][0]               
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 68, 4)         0           dot_1[0][0]                      
____________________________________________________________________________________________________
sequential_2 (Sequential)        multiple              88          input_1[0][0]                    
____________________________________________________________________________________________________
add_1 (Add)                      (None, 68, 4)         0           activation_1[0][0]               
                                                                   sequential_2[1][0]               
____________________________________________________________________________________________________
permute_1 (Permute)              (None, 4, 68)         0           add_1[0][0]                      
____________________________________________________________________________________________________
concatenate_1 (Concatenate)      (None, 4, 132)        0           permute_1[0][0]                  
                                                                   sequential_3[1][0]               
____________________________________________________________________________________________________
lstm_1 (LSTM)                    (None, 4, 32)         21120       concatenate_1[0][0]              
____________________________________________________________________________________________________
dropout_4 (Dropout)              (None, 4, 32)         0           lstm_1[0][0]                     
____________________________________________________________________________________________________
lstm_2 (LSTM)                    (None, 4, 32)         8320        dropout_4[0][0]                  
____________________________________________________________________________________________________
lstm_3 (LSTM)                    (None, 4, 32)         8320        lstm_2[0][0]                     
____________________________________________________________________________________________________
lstm_4 (LSTM)                    (None, 4, 32)         8320        lstm_3[0][0]                     
____________________________________________________________________________________________________
lstm_5 (LSTM)                    (None, 4, 32)         8320        lstm_4[0][0]                     
____________________________________________________________________________________________________
lstm_6 (LSTM)                    (None, 4, 32)         8320        lstm_5[0][0]                     
____________________________________________________________________________________________________
lstm_7 (LSTM)                    (None, 4, 32)         8320        lstm_6[0][0]                     
____________________________________________________________________________________________________
lstm_8 (LSTM)                    (None, 4, 32)         8320        lstm_7[0][0]                     
____________________________________________________________________________________________________
lstm_9 (LSTM)                    (None, 4, 32)         8320        lstm_8[0][0]                     
____________________________________________________________________________________________________
lstm_10 (LSTM)                   (None, 32)            8320        lstm_9[0][0]                     
____________________________________________________________________________________________________
dropout_5 (Dropout)              (None, 32)            0           lstm_10[0][0]                    
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 22)            726         dropout_5[0][0]                  
____________________________________________________________________________________________________
activation_2 (Activation)        (None, 22)            0           dense_1[0][0]                    
====================================================================================================