{"keras_version": "2.0.8", "class_name": "Model", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 3], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "conv2d_1", "class_name": "Conv2D", "config": {"kernel_constraint": null, "strides": [2, 2], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "data_format": "channels_last", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 32, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_1", "trainable": false}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": false, "name": "batch_normalization_1", "gamma_regularizer": null, "beta_regularizer": null, "center": true, "momentum": 0.99, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": false}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "conv2d_2", "class_name": "Conv2D", "config": {"kernel_constraint": null, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "data_format": "channels_last", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 32, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_2", "trainable": false}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": false, "name": "batch_normalization_2", "gamma_regularizer": null, "beta_regularizer": null, "center": true, "momentum": 0.99, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "activation_2", "class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": false}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"name": "conv2d_3", "class_name": "Conv2D", "config": {"kernel_constraint": null, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 64, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_3", "trainable": false}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": false, "name": "batch_normalization_3", "gamma_regularizer": null, "beta_regularizer": null, "center": true, "momentum": 0.99, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "activation_3", "class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": false}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"name": "max_pooling2d_1", "class_name": "MaxPooling2D", "config": {"pool_size": [3, 3], "name": "max_pooling2d_1", "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": false}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "conv2d_4", "class_name": "Conv2D", "config": {"kernel_constraint": null, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "data_format": "channels_last", "kernel_size": [1, 1], "activity_regularizer": null, "filters": 80, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_4", "trainable": false}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": false, "name": "batch_normalization_4", "gamma_regularizer": null, "beta_regularizer": null, "center": true, "momentum": 0.99, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"name": "activation_4", "class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": false}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"name": "conv2d_5", "class_name": "Conv2D", "config": {"kernel_constraint": null, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "data_format": "channels_last", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 192, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_5", "trainable": false}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"name": "batch_normalization_5", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": false, "name": "batch_normalization_5", "gamma_regularizer": null, "beta_regularizer": null, "center": true, "momentum": 0.99, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"name": "activation_5", "class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": false}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"name": "max_pooling2d_2", "class_name": "MaxPooling2D", "config": {"pool_size": [3, 3], "name": "max_pooling2d_2", "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": false}, "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"name": "conv2d_9", "class_name": "Conv2D", "config": {"kernel_constraint": null, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "activity_regularizer": null, "filters": 64, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_9", "trainable": false}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "batch_normalization_9", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": false, "name": "batch_normalization_9", "gamma_regularizer": null, "beta_regularizer": null, "center": true, "momentum": 0.99, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"name": "activation_9", "class_name": "Activation", "config": {"name": "activation_9", "activation": "relu", "trainable": false}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"name": "conv2d_7", "class_name": "Conv2D", "config": {"kernel_constraint": null, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "activity_regularizer": null, "filters": 48, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_7", "trainable": false}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "conv2d_10", "class_name": "Conv2D", "config": {"kernel_constraint": null, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 96, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_10", "trainable": false}, "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"name": "batch_normalization_7", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": false, "name": "batch_normalization_7", "gamma_regularizer": null, "beta_regularizer": null, "center": true, "momentum": 0.99, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"name": "batch_normalization_10", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": false, "name": "batch_normalization_10", "gamma_regularizer": null, "beta_regularizer": null, "center": true, "momentum": 0.99, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"name": "activation_7", "class_name": "Activation", "config": {"name": "activation_7", "activation": "relu", "trainable": false}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"name": "activation_10", "class_name": "Activation", "config": {"name": "activation_10", "activation": "relu", "trainable": false}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"name": "average_pooling2d_1", "class_name": "AveragePooling2D", "config": {"pool_size": [3, 3], "name": "average_pooling2d_1", "padding": "same", "data_format": "channels_last", "strides": [1, 1], "trainable": false}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "conv2d_6", "class_name": "Conv2D", "config": {"kernel_constraint": null, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "activity_regularizer": null, "filters": 64, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_6", "trainable": false}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "conv2d_8", "class_name": "Conv2D", "config": {"kernel_constraint": null, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [5, 5], "activity_regularizer": null, "filters": 64, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_8", "trainable": false}, "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"name": "conv2d_11", "class_name": "Conv2D", "config": {"kernel_constraint": null, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 96, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_11", "trainable": false}, "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"name": "conv2d_12", "class_name": "Conv2D", "config": {"kernel_constraint": null, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "activity_regularizer": null, "filters": 32, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_12", "trainable": false}, "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]]}, {"name": "batch_normalization_6", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": false, "name": "batch_normalization_6", "gamma_regularizer": null, "beta_regularizer": null, "center": true, "momentum": 0.99, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"name": "batch_normalization_8", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": false, "name": "batch_normalization_8", "gamma_regularizer": null, "beta_regularizer": null, "center": true, "momentum": 0.99, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"name": "batch_normalization_11", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": false, "name": "batch_normalization_11", "gamma_regularizer": null, "beta_regularizer": null, "center": true, "momentum": 0.99, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"name": "batch_normalization_12", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": false, "name": "batch_normalization_12", "gamma_regularizer": null, "beta_regularizer": null, "center": true, "momentum": 0.99, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"name": "activation_6", "class_name": "Activation", "config": {"name": "activation_6", "activation": "relu", "trainable": false}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"name": "activation_8", "class_name": "Activation", "config": {"name": "activation_8", "activation": "relu", "trainable": false}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"name": "activation_11", "class_name": "Activation", "config": {"name": "activation_11", "activation": "relu", "trainable": false}, "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"name": "activation_12", "class_name": "Activation", "config": {"name": "activation_12", "activation": "relu", "trainable": false}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"name": "mixed0", "class_name": "Concatenate", "config": {"name": "mixed0", "trainable": false, "axis": 3}, "inbound_nodes": [[["activation_6", 0, 0, {}], ["activation_8", 0, 0, {}], ["activation_11", 0, 0, {}], ["activation_12", 0, 0, {}]]]}, {"name": "conv2d_16", "class_name": "Conv2D", "config": {"kernel_constraint": null, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "activity_regularizer": null, "filters": 64, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_16", "trainable": false}, "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"name": "batch_normalization_16", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": false, "name": "batch_normalization_16", "gamma_regularizer": null, "beta_regularizer": null, "center": true, "momentum": 0.99, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"name": "activation_16", "class_name": "Activation", "config": {"name": "activation_16", "activation": "relu", "trainable": false}, "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"name": "conv2d_14", "class_name": "Conv2D", "config": {"kernel_constraint": null, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "activity_regularizer": null, "filters": 48, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_14", "trainable": false}, "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"name": "conv2d_17", "class_name": "Conv2D", "config": {"kernel_constraint": null, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 96, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_17", "trainable": false}, "inbound_nodes": [[["activation_16", 0, 0, {}]]]}, {"name": "batch_normalization_14", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": false, "name": "batch_normalization_14", "gamma_regularizer": null, "beta_regularizer": null, "center": true, "momentum": 0.99, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"name": "batch_normalization_17", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": false, "name": "batch_normalization_17", "gamma_regularizer": null, "beta_regularizer": null, "center": true, "momentum": 0.99, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"name": "activation_14", "class_name": "Activation", "config": {"name": "activation_14", "activation": "relu", "trainable": false}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"name": "activation_17", "class_name": "Activation", "config": {"name": "activation_17", "activation": "relu", "trainable": false}, "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]]}, {"name": "average_pooling2d_2", "class_name": "AveragePooling2D", "config": {"pool_size": [3, 3], "name": "average_pooling2d_2", "padding": "same", "data_format": "channels_last", "strides": [1, 1], "trainable": false}, "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"name": "conv2d_13", "class_name": "Conv2D", "config": {"kernel_constraint": null, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "activity_regularizer": null, "filters": 64, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_13", "trainable": false}, "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"name": "conv2d_15", "class_name": "Conv2D", "config": {"kernel_constraint": null, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [5, 5], "activity_regularizer": null, "filters": 64, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_15", "trainable": false}, "inbound_nodes": [[["activation_14", 0, 0, {}]]]}, {"name": "conv2d_18", "class_name": "Conv2D", "config": {"kernel_constraint": null, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 96, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_18", "trainable": false}, "inbound_nodes": [[["activation_17", 0, 0, {}]]]}, {"name": "conv2d_19", "class_name": "Conv2D", "config": {"kernel_constraint": null, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "activity_regularizer": null, "filters": 64, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_19", "trainable": false}, "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]]}, {"name": "batch_normalization_13", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": false, "name": "batch_normalization_13", "gamma_regularizer": null, "beta_regularizer": null, "center": true, "momentum": 0.99, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"name": "batch_normalization_15", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": false, "name": "batch_normalization_15", "gamma_regularizer": null, "beta_regularizer": null, "center": true, "momentum": 0.99, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"name": "batch_normalization_18", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": false, "name": "batch_normalization_18", "gamma_regularizer": null, "beta_regularizer": null, "center": true, "momentum": 0.99, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"name": "batch_normalization_19", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": false, "name": "batch_normalization_19", "gamma_regularizer": null, "beta_regularizer": null, "center": true, "momentum": 0.99, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"name": "activation_13", "class_name": "Activation", "config": {"name": "activation_13", "activation": "relu", "trainable": false}, "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"name": "activation_15", "class_name": "Activation", "config": {"name": "activation_15", "activation": "relu", "trainable": false}, "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]]}, {"name": "activation_18", "class_name": "Activation", "config": {"name": "activation_18", "activation": "relu", "trainable": false}, "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]]}, {"name": "activation_19", "class_name": "Activation", "config": {"name": "activation_19", "activation": "relu", "trainable": false}, "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]]}, {"name": "mixed1", "class_name": "Concatenate", "config": {"name": "mixed1", "trainable": false, "axis": 3}, "inbound_nodes": [[["activation_13", 0, 0, {}], ["activation_15", 0, 0, {}], ["activation_18", 0, 0, {}], ["activation_19", 0, 0, {}]]]}, {"name": "conv2d_23", "class_name": "Conv2D", "config": {"kernel_constraint": null, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "activity_regularizer": null, "filters": 64, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_23", "trainable": false}, "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"name": "batch_normalization_23", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": false, "name": "batch_normalization_23", "gamma_regularizer": null, "beta_regularizer": null, "center": true, "momentum": 0.99, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_23", 0, 0, {}]]]}, {"name": "activation_23", "class_name": "Activation", "config": {"name": "activation_23", "activation": "relu", "trainable": false}, "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]]}, {"name": "conv2d_21", "class_name": "Conv2D", "config": {"kernel_constraint": null, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "activity_regularizer": null, "filters": 48, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_21", "trainable": false}, "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"name": "conv2d_24", "class_name": "Conv2D", "config": {"kernel_constraint": null, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 96, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_24", "trainable": false}, "inbound_nodes": [[["activation_23", 0, 0, {}]]]}, {"name": "batch_normalization_21", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": false, "name": "batch_normalization_21", "gamma_regularizer": null, "beta_regularizer": null, "center": true, "momentum": 0.99, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"name": "batch_normalization_24", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": false, "name": "batch_normalization_24", "gamma_regularizer": null, "beta_regularizer": null, "center": true, "momentum": 0.99, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_24", 0, 0, {}]]]}, {"name": "activation_21", "class_name": "Activation", "config": {"name": "activation_21", "activation": "relu", "trainable": false}, "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]]}, {"name": "activation_24", "class_name": "Activation", "config": {"name": "activation_24", "activation": "relu", "trainable": false}, "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]]}, {"name": "average_pooling2d_3", "class_name": "AveragePooling2D", "config": {"pool_size": [3, 3], "name": "average_pooling2d_3", "padding": "same", "data_format": "channels_last", "strides": [1, 1], "trainable": false}, "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"name": "conv2d_20", "class_name": "Conv2D", "config": {"kernel_constraint": null, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "activity_regularizer": null, "filters": 64, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_20", "trainable": false}, "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"name": "conv2d_22", "class_name": "Conv2D", "config": {"kernel_constraint": null, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [5, 5], "activity_regularizer": null, "filters": 64, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_22", "trainable": false}, "inbound_nodes": [[["activation_21", 0, 0, {}]]]}, {"name": "conv2d_25", "class_name": "Conv2D", "config": {"kernel_constraint": null, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 96, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_25", "trainable": false}, "inbound_nodes": [[["activation_24", 0, 0, {}]]]}, {"name": "conv2d_26", "class_name": "Conv2D", "config": {"kernel_constraint": null, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "activity_regularizer": null, "filters": 64, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_26", "trainable": false}, "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]]}, {"name": "batch_normalization_20", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": false, "name": "batch_normalization_20", "gamma_regularizer": null, "beta_regularizer": null, "center": true, "momentum": 0.99, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"name": "batch_normalization_22", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": false, "name": "batch_normalization_22", "gamma_regularizer": null, "beta_regularizer": null, "center": true, "momentum": 0.99, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_22", 0, 0, {}]]]}, {"name": "batch_normalization_25", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": false, "name": "batch_normalization_25", "gamma_regularizer": null, "beta_regularizer": null, "center": true, "momentum": 0.99, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_25", 0, 0, {}]]]}, {"name": "batch_normalization_26", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": false, "name": "batch_normalization_26", "gamma_regularizer": null, "beta_regularizer": null, "center": true, "momentum": 0.99, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_26", 0, 0, {}]]]}, {"name": "activation_20", "class_name": "Activation", "config": {"name": "activation_20", "activation": "relu", "trainable": false}, "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]]}, {"name": "activation_22", "class_name": "Activation", "config": {"name": "activation_22", "activation": "relu", "trainable": false}, "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]]}, {"name": "activation_25", "class_name": "Activation", "config": {"name": "activation_25", "activation": "relu", "trainable": false}, "inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]]}, {"name": "activation_26", "class_name": "Activation", "config": {"name": "activation_26", "activation": "relu", "trainable": false}, "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]]}, {"name": "mixed2", "class_name": "Concatenate", "config": {"name": "mixed2", "trainable": false, "axis": 3}, "inbound_nodes": [[["activation_20", 0, 0, {}], ["activation_22", 0, 0, {}], ["activation_25", 0, 0, {}], ["activation_26", 0, 0, {}]]]}, {"name": "conv2d_28", "class_name": "Conv2D", "config": {"kernel_constraint": null, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "activity_regularizer": null, "filters": 64, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_28", "trainable": false}, "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"name": "batch_normalization_28", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": false, "name": "batch_normalization_28", "gamma_regularizer": null, "beta_regularizer": null, "center": true, "momentum": 0.99, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_28", 0, 0, {}]]]}, {"name": "activation_28", "class_name": "Activation", "config": {"name": "activation_28", "activation": "relu", "trainable": false}, "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]]}, {"name": "conv2d_29", "class_name": "Conv2D", "config": {"kernel_constraint": null, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 96, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_29", "trainable": false}, "inbound_nodes": [[["activation_28", 0, 0, {}]]]}, {"name": "batch_normalization_29", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": false, "name": "batch_normalization_29", "gamma_regularizer": null, "beta_regularizer": null, "center": true, "momentum": 0.99, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_29", 0, 0, {}]]]}, {"name": "activation_29", "class_name": "Activation", "config": {"name": "activation_29", "activation": "relu", "trainable": false}, "inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]]}, {"name": "conv2d_27", "class_name": "Conv2D", "config": {"kernel_constraint": null, "strides": [2, 2], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "data_format": "channels_last", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 384, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_27", "trainable": false}, "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"name": "conv2d_30", "class_name": "Conv2D", "config": {"kernel_constraint": null, "strides": [2, 2], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "data_format": "channels_last", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 96, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_30", "trainable": false}, "inbound_nodes": [[["activation_29", 0, 0, {}]]]}, {"name": "batch_normalization_27", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": false, "name": "batch_normalization_27", "gamma_regularizer": null, "beta_regularizer": null, "center": true, "momentum": 0.99, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_27", 0, 0, {}]]]}, {"name": "batch_normalization_30", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": false, "name": "batch_normalization_30", "gamma_regularizer": null, "beta_regularizer": null, "center": true, "momentum": 0.99, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_30", 0, 0, {}]]]}, {"name": "activation_27", "class_name": "Activation", "config": {"name": "activation_27", "activation": "relu", "trainable": false}, "inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]]}, {"name": "activation_30", "class_name": "Activation", "config": {"name": "activation_30", "activation": "relu", "trainable": false}, "inbound_nodes": [[["batch_normalization_30", 0, 0, {}]]]}, {"name": "max_pooling2d_3", "class_name": "MaxPooling2D", "config": {"pool_size": [3, 3], "name": "max_pooling2d_3", "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": false}, "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"name": "mixed3", "class_name": "Concatenate", "config": {"name": "mixed3", "trainable": false, "axis": 3}, "inbound_nodes": [[["activation_27", 0, 0, {}], ["activation_30", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]]}, {"name": "conv2d_35", "class_name": "Conv2D", "config": {"kernel_constraint": null, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "activity_regularizer": null, "filters": 128, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_35", "trainable": false}, "inbound_nodes": [[["mixed3", 0, 0, {}]]]}, {"name": "batch_normalization_35", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": false, "name": "batch_normalization_35", "gamma_regularizer": null, "beta_regularizer": null, "center": true, "momentum": 0.99, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_35", 0, 0, {}]]]}, {"name": "activation_35", "class_name": "Activation", "config": {"name": "activation_35", "activation": "relu", "trainable": false}, "inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]]}, {"name": "conv2d_36", "class_name": "Conv2D", "config": {"kernel_constraint": null, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_last", "kernel_size": [7, 1], "activity_regularizer": null, "filters": 128, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": false, "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_36", "trainable": false}, "inbound_nodes": [[["activation_35", 0, 0, {}]]]}, {"name": "batch_normalization_36", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": false, "name": "batch_normalization_36", "gamma_regularizer": null, "beta_regularizer": null, "center": true, "momentum": 0.99, "scale": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_36", 0, 0, {}]]]}, {"name": "activation_36", "class_name": "Activation", "config": {"name": "activation_36", "activation": "relu", "trainable": false}, "inbound_nodes": [[["batch_normalization_36", 0, 0, {}]]]}, 